[about]
0 = 关于智能币1
1 = 确定1
1119 = <a>智能币官网1</a>
1128 = 智能币UIDemoV0.01版1
1129 = Copyright (C) 20141
1130 = 智能币官方公测QQ群：334368391

[wallet]
0=钱包
1101 = 钱包公钥:1
1100 = 账户信息：1
1102 = 最近交易信息：1
1124 = 高度：1
1125 = 信息：1
1107 = 刷新账户信息1
1108 = 刷新交易信息1
1119 = <a>进入论坛领取智能币(测试用)1</a>

[business]
1001 = 买家购买1
1002 = 买家申请仲裁1
1003 = 卖家确认1
1004 = 仲裁者裁决1
1005 = 买家组包1
1006 = 卖家签名1
1011 = 买家确认1
1055 = 担保交易(第三方裁决)1
1056 = 抵押交易(无裁决)1
1063 = P2P赌约1
1008 = 发起赌约1
1009 = 接受赌约1
1010 = 揭赌1
1126 = <a>担保交易应用操作流程1</a>
1120 = <a>抵押交易应用操作流程1</a>
1127 = <a>P2P对赌应用操作流程1</a>

[rpc]
0 = RPC命令1
1004 = 输入：1

[base]
1059 = 金额：1
1131 = 转出地址：1
1132 = 转入地址：1
1133 = 挖矿1
1001 = 开始挖矿1
1002 = 停止挖矿1
1114 = 账号：1
1019 = 小费：1
1041 = 转账1
1043 = 注册账号1
1003 = 发送交易1
1085 = 执行结果1

[baseex]
1114 = 账号地址：1
1019 = 小费：1
1094 = 权限有效期：1
1095 = 单次最大消费金额：1
1096 = 累计消费最大金额：1
1097 = 每天最大消费金额：1
1098 = 用户自定义数据：1
1003 = 发送1
1085 = 执行结果1
1001 = 获取应用ID1
1108 = 账号地址：1
1109 = 小费：1
1111 = 应用路径：1
1073 = 注册应用1
1085 = 应用ID：1
1022 = 应用Hash：1
1042 = 应用授权1

[sesure]
0 = 担保交易1
1003 = 发送1
1014 = 买家ID:1
1015 = 卖家ID：1
1016 = 仲裁者ID:1
1017 = 购买金额：1
1018 = 仲裁押金：1
1019 = 仲裁手续费：1
1020 = 最大赔偿金额：1
1021 = 超时高度1
1022 = 上一个交易哈希：1
1023 = 赔款额度：1
1085 = 结果：1
1048 = 应用ID：1
1135 = 地址：1
1134 = 小费:1
1136 = 交易数据1
1137 = 合约数据1
1052 = 仲裁级数：1

[darkcoin]
0 = 抵押交易1
1014 = 买家ID：1
1015 = 卖家ID：1
1019 = 小费：1
1021 = 超时高度：1
1085 = 结果：1
1003 = 发送合约1
1059 = 交易金额：1
1058 = 上个交易hash：1
1004 = 发送签名1
1048 = 应用ID：1
1016 = 买家地址：1
1017 = 卖家地址：1
1060 = 合约内容:1

[p2pbet]
0 = P2P对赌1
1003 = 发送1
1085 = 结果：1
1065 = 发起赌约1
1067 = 接受赌约1
1069 = 揭赌1
1066 = 金额：1
1070 = 高度：1
1071 = 随机数：1
1075 = 金额：1
1076 = 赌约HASH：1
1077 = 随机数：1
1081 = 赌约HASH：1
1082 = 随机数：1
1048 = 应用ID：1
1001 = 刷新随机数1
1002 = 获取随机数1
1091 = 地址：1
1096 = 地址：1
1049 = 应用ID：1
1050 = 应用ID：1






